using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Home_Work_1
{
    internal class Task
    {

        /*task
         Задача № 1

Необходимо написать консольную программу, где пользователь будет вводить с
клавиатуры 2 числа. Числа будут сравниваться с последующим выводом в консоль
результата этого сравнения (равны ли значения, а если нет, то какое число
больше/меньше).

Задача № 2
Теперь несколько усложним ситуацию в создаваемой программе. Пусть пользователь
имеет возможность ввести одно число, причем:
— когда значение больше пяти и одновременно с этим меньше десяти, выводится один
текст с соответствующим сообщением;
— когда значение не попадает в указанный диапазон, программа его не узнает, выводя
другой текст с соответствующим сообщением.

Задача № 3
Далее решим задачу сложнее. Представим банк, в котором алгоритм начисления
процента по вкладу зависит от суммы вклада. На вход будет подаваться число (сумма
вклада). При значении меньше 100, будет начислено 5 %, если значение находится в
диапазоне от ста до двухсот — 7 %, если больше — 10 %. Отработав, программа должна
вывести общую сумму с начисленными процентами. Для решения этой задачи
воспользуемся выражением
Convert.ToDouble(Console.ReadLine()),
которое нам пригодится для получения вводимого с клавиатуры числа.

Задача № 4
Напоследок еще немного усложним алгоритм, расширив условия предыдущего примера.
Пусть банк регулярно начисляет по всем вкладам не только положенные по договору
проценты, но еще и бонусы. И пусть, к примеру, банк решит выполнить доначисление по
всем клиентским вкладам в размере 15 единиц без учета суммы. Поменяем программу,
отображенную выше, чтобы к итоговой сумме были добавлены еще и бонусы.

         
         */
    }
}
